Revit 2024 API
Material.ClearMaterialAspect Method
 Removes an aspect from the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void ClearMaterialAspect(
	MaterialAspect aspect
)
Visual Basic
Public Sub ClearMaterialAspect ( _
	aspect As MaterialAspect _
)
Visual C++
public:
void ClearMaterialAspect(
	MaterialAspect aspect
)
Parameters
aspect
Type: Autodesk.Revit.DB.MaterialAspect
 The material aspect.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Material Class
Autodesk.Revit.DB Namespace